//*****************************************************************
//	스네이크 객체지향
//	20151736 최승환
//*****************************************************************
//////////////////////////////////////////////////////////////////
#include "HEADER_GROUP.h"
#include "CGAME_SYSTEM.h"
#include "SNAKE_GAME_CLASS.h"
#include "FOOTBALL_GAME_CLASS.h"
//////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////

//////////////////////////////////////////////////////////////////

int main()
{
	int Inp = 0;
	CGAME_SYSTEM * game;
	
	while (1)
	{
		printf("게임을 선택해주세요.\n1. 스네이크 게임\m2.풋볼 게임\n입력 : ");
		scanf("%d",Inp);
		switch (Inp)
		{
		case 1:
			game = new SNAKE_GAME_CLASS;
			game->Run();
			free(game);
			break;
		case 2:
			game = new FOOTBALL_GAME_CLASS;
			game->Run();
			free(game);
			break;
		default:
			break;
		}
	}
	/*	SNAKE_GAME_CLASS Game1;
		Game1.Run();

		FOOTBALL_GAME_CLASS Game2;
		Game2.Run();*/
}


